app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email_address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", ""], ["last_name", ""], ["email_address", ""], ["created_at", "2015-02-23 23:42:01.736244"], ["updated_at", "2015-02-23 23:42:01.736244"]]